of9/SbmBloodFoam/tutorials/2DSimpleShearFlow_blood/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0)
    (0.16 0 0)
    (0.16 0.00004 0)
    (0 0.00004 0)
    (0 0 1e-05)
    (0.16 0 1e-05)
    (0.16 0.00004 1e-05)
    (0 0.00004 1e-05)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (400 36 1) simpleGrading (1 1 1)			
);

edges           
(
);

patches         
(
    patch inlet 
    (
	(0 4 7 3)        

    )
    patch outlet
    (
        (2 6 5 1)
    )
    patch lowerWall 
    (
        (1 5 4 0)
    )
    patch upperWall 
    (
        (3 7 6 2)
    )        
    empty frontAndBack 
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
