of9/SbmBloodFoam/tutorials/2DSimpleShearFlow_blood/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          36;
        startFace       7064;
    }
    outlet
    {
        type            patch;
        nFaces          36;
        startFace       7100;
    }
    lowerWall
    {
        type            patch;
        nFaces          100;
        startFace       7136;
    }
    upperWall
    {
        type            patch;
        nFaces          100;
        startFace       7236;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          7200;
        startFace       7336;
    }
)

// ************************************************************************* //
